import {Component} from '@angular/core';
// import {NgbCarouselConfig} from '@ng-bootstrap/ng-bootstrap';

import {MainSliderFilm} from "./main-slider.model";

@Component({
  selector: 'app-main-slider',
  templateUrl: './main-slider.component.html',
  styleUrls: ['./main-slider.component.scss'],
  // providers: [NgbCarouselConfig]
})

export class MainSliderComponent {
  showNavigationArrows = false;
  showNavigationIndicators = true;

  mainSliderFilms: MainSliderFilm[] = [
    new MainSliderFilm(
      ['Бойовик', 'Драма', 'Історичні'],
      'ВАРЯГ',
      'Десяте століття, Ісландія. Спадкоємець престолу вікінгів Амлет раптово втратив все. Принц, який виховувався турботливими батьками, ніколи не знав поневірянь, холоду і голоду. Хлопця оточували віддані приятелі, які в майбутньому мали стати його радниками.',
      'IMDb: 7.1',
      '2022',
      '16+',
      'Дивитись',
      'Додати в обране',
      '../../../assets/images/slide1.png'
    ),
    new MainSliderFilm(
      ['Бойовик', 'Драма', 'Історичні'],
      'ВАРЯГ',
      'Десяте століття, Ісландія. Спадкоємець престолу вікінгів Амлет раптово втратив все. Принц, який виховувався турботливими батьками, ніколи не знав поневірянь, холоду і голоду. Хлопця оточували віддані приятелі, які в майбутньому мали стати його радниками.',
      'IMDb: 7.1',
      '2022',
      '16+',
      'Дивитись',
      'Додати в обране',
      '../../../assets/images/slide2.jpeg'
    ),
    new MainSliderFilm(
      ['Бойовик', 'Драма', 'Історичні'],
      'ВАРЯГ',
      'Десяте століття, Ісландія. Спадкоємець престолу вікінгів Амлет раптово втратив все. Принц, який виховувався турботливими батьками, ніколи не знав поневірянь, холоду і голоду. Хлопця оточували віддані приятелі, які в майбутньому мали стати його радниками.',
      'IMDb: 7.1',
      '2022',
      '16+',
      'Дивитись',
      'Додати в обране',
      '../../../assets/images/slide3.jpeg'
    ),
    new MainSliderFilm(
      ['Бойовик', 'Драма', 'Історичні'],
      'ВАРЯГ',
      'Десяте століття, Ісландія. Спадкоємець престолу вікінгів Амлет раптово втратив все. Принц, який виховувався турботливими батьками, ніколи не знав поневірянь, холоду і голоду. Хлопця оточували віддані приятелі, які в майбутньому мали стати його радниками.',
      'IMDb: 7.1',
      '2022',
      '16+',
      'Дивитись',
      'Додати в обране',
      '../../../assets/images/slide4.jpeg'
    ),
    new MainSliderFilm(
      ['Бойовик', 'Драма', 'Історичні'],
      'ВАРЯГ',
      'Десяте століття, Ісландія. Спадкоємець престолу вікінгів Амлет раптово втратив все. Принц, який виховувався турботливими батьками, ніколи не знав поневірянь, холоду і голоду. Хлопця оточували віддані приятелі, які в майбутньому мали стати його радниками.',
      'IMDb: 7.1',
      '2022',
      '16+',
      'Дивитись',
      'Додати в обране',
      '../../../assets/images/slide5.jpeg'
    )
  ];
}
